test_JMeter/test150/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3256,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2413.303132678132,
    "medianResTime" : 2305.0,
    "minResTime" : 205.0,
    "maxResTime" : 4346.0,
    "pct1ResTime" : 3788.0,
    "pct2ResTime" : 4070.449999999999,
    "pct3ResTime" : 4272.0,
    "throughput" : 64.79730939919203,
    "receivedKBytesPerSec" : 596.334414770692,
    "sentKBytesPerSec" : 21.061986308185237
  },
  "商品列表" : {
    "transaction" : "商品列表",
    "sampleCount" : 1656,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3383.2228260869574,
    "medianResTime" : 3582.0,
    "minResTime" : 1096.0,
    "maxResTime" : 4346.0,
    "pct1ResTime" : 4028.1999999999975,
    "pct2ResTime" : 4229.749999999999,
    "pct3ResTime" : 4282.43,
    "throughput" : 32.955879718999384,
    "receivedKBytesPerSec" : 343.3976919938705,
    "sentKBytesPerSec" : 10.427446317339648
  },
  "商品详情" : {
    "transaction" : "商品详情",
    "sampleCount" : 1600,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1409.4362500000007,
    "medianResTime" : 1447.5,
    "minResTime" : 205.0,
    "maxResTime" : 2645.0,
    "pct1ResTime" : 2071.0,
    "pct2ResTime" : 2228.0,
    "pct3ResTime" : 2526.9300000000003,
    "throughput" : 35.30839677810879,
    "receivedKBytesPerSec" : 280.47704695603005,
    "sentKBytesPerSec" : 11.79245283018868
  }
}